###################################################################

# Created by write_sdc on Mon Mar 3 09:49:53 2014

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 5 [get_ports {data_out[31]}]
set_load -pin_load 5 [get_ports {data_out[30]}]
set_load -pin_load 5 [get_ports {data_out[29]}]
set_load -pin_load 5 [get_ports {data_out[28]}]
set_load -pin_load 5 [get_ports {data_out[27]}]
set_load -pin_load 5 [get_ports {data_out[26]}]
set_load -pin_load 5 [get_ports {data_out[25]}]
set_load -pin_load 5 [get_ports {data_out[24]}]
set_load -pin_load 5 [get_ports {data_out[23]}]
set_load -pin_load 5 [get_ports {data_out[22]}]
set_load -pin_load 5 [get_ports {data_out[21]}]
set_load -pin_load 5 [get_ports {data_out[20]}]
set_load -pin_load 5 [get_ports {data_out[19]}]
set_load -pin_load 5 [get_ports {data_out[18]}]
set_load -pin_load 5 [get_ports {data_out[17]}]
set_load -pin_load 5 [get_ports {data_out[16]}]
set_load -pin_load 5 [get_ports {data_out[15]}]
set_load -pin_load 5 [get_ports {data_out[14]}]
set_load -pin_load 5 [get_ports {data_out[13]}]
set_load -pin_load 5 [get_ports {data_out[12]}]
set_load -pin_load 5 [get_ports {data_out[11]}]
set_load -pin_load 5 [get_ports {data_out[10]}]
set_load -pin_load 5 [get_ports {data_out[9]}]
set_load -pin_load 5 [get_ports {data_out[8]}]
set_load -pin_load 5 [get_ports {data_out[7]}]
set_load -pin_load 5 [get_ports {data_out[6]}]
set_load -pin_load 5 [get_ports {data_out[5]}]
set_load -pin_load 5 [get_ports {data_out[4]}]
set_load -pin_load 5 [get_ports {data_out[3]}]
set_load -pin_load 5 [get_ports {data_out[2]}]
set_load -pin_load 5 [get_ports {data_out[1]}]
set_load -pin_load 5 [get_ports {data_out[0]}]
create_clock [get_ports clk]  -period 7  -waveform {0 3.5}
set_input_delay -clock clk  -max 0.8  [get_ports clk]
set_input_delay -clock clk  -max 0.8  [get_ports rdn]
set_input_delay -clock clk  -max 0.8  [get_ports wrn]
set_input_delay -clock clk  -max 0.8  [get_ports {address[10]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[9]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[8]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[7]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[6]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[5]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[4]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[3]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[2]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[1]}]
set_input_delay -clock clk  -max 0.8  [get_ports {address[0]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[31]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[30]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[29]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[28]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[27]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[26]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[25]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[24]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[23]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[22]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[21]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[20]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[19]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[18]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[17]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[16]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[15]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[14]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[13]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[12]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[11]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[10]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[9]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[8]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[7]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[6]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[5]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[4]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[3]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[2]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[1]}]
set_input_delay -clock clk  -max 0.8  [get_ports {bit_wen[0]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[31]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[30]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[29]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[28]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[27]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[26]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[25]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[24]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[23]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[22]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[21]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[20]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[19]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[18]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[17]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[16]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[15]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[14]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[13]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[12]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[11]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[10]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[9]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[8]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[7]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[6]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[5]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[4]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[3]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[2]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[1]}]
set_input_delay -clock clk  -max 0.8  [get_ports {data_in[0]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[31]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[30]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[29]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[28]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[27]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[26]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[25]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[24]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[23]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[22]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[21]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[20]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[19]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[18]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[17]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[16]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[15]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[14]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[13]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[12]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[11]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[10]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[9]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[8]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[7]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[6]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[5]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[4]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[3]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[2]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[1]}]
set_output_delay -clock clk  -max 0.8  [get_ports {data_out[0]}]
set_input_transition -max 1  [get_ports clk]
set_input_transition -max 1  [get_ports rdn]
set_input_transition -max 1  [get_ports wrn]
set_input_transition -max 1  [get_ports {address[10]}]
set_input_transition -max 1  [get_ports {address[9]}]
set_input_transition -max 1  [get_ports {address[8]}]
set_input_transition -max 1  [get_ports {address[7]}]
set_input_transition -max 1  [get_ports {address[6]}]
set_input_transition -max 1  [get_ports {address[5]}]
set_input_transition -max 1  [get_ports {address[4]}]
set_input_transition -max 1  [get_ports {address[3]}]
set_input_transition -max 1  [get_ports {address[2]}]
set_input_transition -max 1  [get_ports {address[1]}]
set_input_transition -max 1  [get_ports {address[0]}]
set_input_transition -max 1  [get_ports {bit_wen[31]}]
set_input_transition -max 1  [get_ports {bit_wen[30]}]
set_input_transition -max 1  [get_ports {bit_wen[29]}]
set_input_transition -max 1  [get_ports {bit_wen[28]}]
set_input_transition -max 1  [get_ports {bit_wen[27]}]
set_input_transition -max 1  [get_ports {bit_wen[26]}]
set_input_transition -max 1  [get_ports {bit_wen[25]}]
set_input_transition -max 1  [get_ports {bit_wen[24]}]
set_input_transition -max 1  [get_ports {bit_wen[23]}]
set_input_transition -max 1  [get_ports {bit_wen[22]}]
set_input_transition -max 1  [get_ports {bit_wen[21]}]
set_input_transition -max 1  [get_ports {bit_wen[20]}]
set_input_transition -max 1  [get_ports {bit_wen[19]}]
set_input_transition -max 1  [get_ports {bit_wen[18]}]
set_input_transition -max 1  [get_ports {bit_wen[17]}]
set_input_transition -max 1  [get_ports {bit_wen[16]}]
set_input_transition -max 1  [get_ports {bit_wen[15]}]
set_input_transition -max 1  [get_ports {bit_wen[14]}]
set_input_transition -max 1  [get_ports {bit_wen[13]}]
set_input_transition -max 1  [get_ports {bit_wen[12]}]
set_input_transition -max 1  [get_ports {bit_wen[11]}]
set_input_transition -max 1  [get_ports {bit_wen[10]}]
set_input_transition -max 1  [get_ports {bit_wen[9]}]
set_input_transition -max 1  [get_ports {bit_wen[8]}]
set_input_transition -max 1  [get_ports {bit_wen[7]}]
set_input_transition -max 1  [get_ports {bit_wen[6]}]
set_input_transition -max 1  [get_ports {bit_wen[5]}]
set_input_transition -max 1  [get_ports {bit_wen[4]}]
set_input_transition -max 1  [get_ports {bit_wen[3]}]
set_input_transition -max 1  [get_ports {bit_wen[2]}]
set_input_transition -max 1  [get_ports {bit_wen[1]}]
set_input_transition -max 1  [get_ports {bit_wen[0]}]
set_input_transition -max 1  [get_ports {data_in[31]}]
set_input_transition -max 1  [get_ports {data_in[30]}]
set_input_transition -max 1  [get_ports {data_in[29]}]
set_input_transition -max 1  [get_ports {data_in[28]}]
set_input_transition -max 1  [get_ports {data_in[27]}]
set_input_transition -max 1  [get_ports {data_in[26]}]
set_input_transition -max 1  [get_ports {data_in[25]}]
set_input_transition -max 1  [get_ports {data_in[24]}]
set_input_transition -max 1  [get_ports {data_in[23]}]
set_input_transition -max 1  [get_ports {data_in[22]}]
set_input_transition -max 1  [get_ports {data_in[21]}]
set_input_transition -max 1  [get_ports {data_in[20]}]
set_input_transition -max 1  [get_ports {data_in[19]}]
set_input_transition -max 1  [get_ports {data_in[18]}]
set_input_transition -max 1  [get_ports {data_in[17]}]
set_input_transition -max 1  [get_ports {data_in[16]}]
set_input_transition -max 1  [get_ports {data_in[15]}]
set_input_transition -max 1  [get_ports {data_in[14]}]
set_input_transition -max 1  [get_ports {data_in[13]}]
set_input_transition -max 1  [get_ports {data_in[12]}]
set_input_transition -max 1  [get_ports {data_in[11]}]
set_input_transition -max 1  [get_ports {data_in[10]}]
set_input_transition -max 1  [get_ports {data_in[9]}]
set_input_transition -max 1  [get_ports {data_in[8]}]
set_input_transition -max 1  [get_ports {data_in[7]}]
set_input_transition -max 1  [get_ports {data_in[6]}]
set_input_transition -max 1  [get_ports {data_in[5]}]
set_input_transition -max 1  [get_ports {data_in[4]}]
set_input_transition -max 1  [get_ports {data_in[3]}]
set_input_transition -max 1  [get_ports {data_in[2]}]
set_input_transition -max 1  [get_ports {data_in[1]}]
set_input_transition -max 1  [get_ports {data_in[0]}]
