###################################################################

# Created by write_sdc on Sat Feb 22 16:02:00 2014

###################################################################
set sdc_version 1.7

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 5 [get_ports BUS_BUSY]
set_load -pin_load 5 [get_ports BUS_MR]
set_load -pin_load 5 [get_ports BUS_MW]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[31]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[30]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[29]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[28]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[27]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[26]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[25]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[24]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[23]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[22]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[21]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[20]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[19]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[18]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[17]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[16]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[15]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[14]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[13]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[12]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[11]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[10]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[9]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[8]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[7]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[6]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[5]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[4]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[3]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[2]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[1]}]
set_load -pin_load 5 [get_ports {BUS_ADDR_OUTBUS[0]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[31]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[30]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[29]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[28]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[27]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[26]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[25]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[24]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[23]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[22]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[21]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[20]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[19]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[18]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[17]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[16]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[15]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[14]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[13]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[12]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[11]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[10]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[9]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[8]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[7]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[6]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[5]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[4]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[3]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[2]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[1]}]
set_load -pin_load 5 [get_ports {BUS_DATA_OUTBUS[0]}]
create_clock [get_ports CLK]  -period 6  -waveform {0 3}
set_input_transition -max 1  [get_ports CLK]
set_input_transition -max 1  [get_ports reset]
set_input_transition -max 1  [get_ports BUS_NREADY]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[31]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[30]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[29]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[28]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[27]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[26]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[25]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[24]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[23]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[22]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[21]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[20]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[19]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[18]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[17]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[16]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[15]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[14]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[13]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[12]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[11]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[10]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[9]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[8]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[7]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[6]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[5]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[4]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[3]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[2]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[1]}]
set_input_transition -max 1  [get_ports {BUS_DATA_INBUS[0]}]
